In [1]:
import numpy as np
import pandas as pd

In [2]:
df_one = {'A':['A0','A1','A2','A3'],
         'B':['B0','B1','B2','B3'],
         }

df_two = {'C':['C0','C1','C2','C3'],
         'D':['D0','D1','D2','D3']}

In [3]:
one = pd.DataFrame(df_one)
two = pd.DataFrame(df_two)

In [4]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [5]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

##### Concatenate along rows | Axis = 0

In [6]:
pd.concat([one,two],axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

##### Concatenate along columns | Axis = 1

In [7]:
pd.concat([one,two],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

##### Concatenate along rows | Axis = 0 (Columns match up)

In [8]:
df_one1 = {'A':['A0','A1','A2','A3'],
         'B':['B0','B1','B2','B3'],
         }

df_two1 = {'A':['C0','C1','C2','C3'],
         'B':['D0','D1','D2','D3']}

In [9]:
one1 = pd.DataFrame(df_one1)
two1 = pd.DataFrame(df_two1)

In [10]:
one1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [11]:
two1

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [18]:
pd.concat([one1,two1])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

##### Merge

In [13]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],
                             'name': ['Andrew','Bob','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],
                      'name':['Xavier','Andrew','Yolanda','Bob']})

In [14]:
registrations

   reg_id    name
0       1  Andrew
1       2     Bob
2       3  Claire
3       4   David

In [15]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

###### pd.merge()

In [22]:
#Inner Join
pd.merge(left = registrations, right = logins,on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2     Bob       4

In [23]:
#left join
pd.merge(left = registrations, right = logins,on='name', how = 'left')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2     Bob     4.0
2       3  Claire     NaN
3       4   David     NaN

In [24]:
#right join
pd.merge(left = registrations, right = logins,on='name', how = 'right')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0      Bob       4

In [25]:
#outer join
pd.merge(left = registrations, right = logins,on='name', how = 'outer')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0      Bob     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

###### Join on Index or Column

In [28]:
registrations = registrations.set_index('name')
registrations

        reg_id
name
Andrew       1
Bob          2
Claire       3
David        4

In [29]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [32]:
pd.merge(registrations,logins,left_index=True,right_on='name', how = 'outer')

     reg_id  log_id     name
1.0     1.0     2.0   Andrew
3.0     2.0     4.0      Bob
NaN     3.0     NaN   Claire
NaN     4.0     NaN    David
0.0     NaN     1.0   Xavier
2.0     NaN     3.0  Yolanda

In [31]:
pd.merge(logins,registrations,right_index=True,left_on='name')

   log_id    name  reg_id
1       2  Andrew       1
3       4     Bob       2

###### Different column names in the tables to be joined

In [34]:
registrations = registrations.reset_index()
registrations

     name  reg_id
0  Andrew       1
1     Bob       2
2  Claire       3
3   David       4

In [38]:
registrations.columns = ['reg_name', 'r_id']

In [39]:
registrations

  reg_name  r_id
0   Andrew     1
1      Bob     2
2   Claire     3
3    David     4

In [40]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [44]:
pd.merge(registrations,logins,left_on='reg_name',right_on='name')#.drop('reg_name',axis=1)

  reg_name  r_id  log_id    name
0   Andrew     1       2  Andrew
1      Bob     2       4     Bob

In [46]:
registrations.columns = ['name','id']
registrations

     name  id
0  Andrew   1
1     Bob   2
2  Claire   3
3   David   4

In [47]:
logins.columns = ['id','name']
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4      Bob

In [49]:
pd.merge(registrations,logins, on = 'name') #_x is for left and _y is for right

     name  id_x  id_y
0  Andrew     1     2
1     Bob     2     4

In [50]:
pd.merge(registrations,logins, on = 'name',suffixes=('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1     Bob       2       4